app/views/trips/edit.html.erb

SELECT "trips".* FROM "trips"
---
          <%= f.datetime_field :month, as: :date_picker, :input_html => { :value => Date.today} %>
            <%= f.collection_select :creator_id, Trip.all, :id, :origin %><br>