app/views/trips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <% @userid= trip.creator_id %>
                <% @user= User.find(@userid) %>