app/views/trips/new.html.erb

        <div class="input-field col s6 ">
          <%= f.collection_select :creator_id, User.all, :id, :fname%><br>
---
SELECT "users".* FROM "users"