app/controllers/trips_controller.rb

    def create

      @user = User.find(current_user.id)
      # puts "user", @user
      @trip = Trip.new(trip_params)
      @trip.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "trips" ("created_at", "updated_at", "origin", "destination", "month", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", 2017-02-10 20:32:17 UTC], ["updated_at", 2017-02-10 20:32:17 UTC], ["origin", "Brooklyn"], ["destination", "Philadelphia"], ["month", 2017-03-27 15:30:00 UTC], ["creator_id", 1]]

    def send_request
      puts "PROCESSING REQUEST!"
      #1- send sendgrid email


      #2- Create new row in the Trips/Rider join table
      # Add rider to this trip
      @trip = Trip.find(params[:trip_id])
      @trip.riders << User.find(params[:current_user_id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "user_trips" ("trip_id", "rider_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["trip_id", 3], ["rider_id", 1], ["created_at", 2017-02-10 21:03:59 UTC], ["updated_at", 2017-02-10 21:03:59 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
      @message = "this is my edit page"
      @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
      @trip = Trip.find(params[:id])
      @trip.update({
        origin: params[:trip][:origin],
        destination: params[:trip][:destination],
        month: params[:trip][:month],
        date: params[:trip][:date],
        time: params[:trip][:time]
        })
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "trips" SET "destination" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["destination", "Arizona"], ["updated_at", 2017-02-10 21:04:18 UTC], ["id", 3]]

    def destroy
      Trip.delete(params[:id])
---
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 5]]