app/controllers/welcome_controller.rb

SELECT "trips".* FROM "trips"
---
  def home
    @welcome = "welcome to your trip planner"
    @trips = Trip.all